/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 2753                              :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: skgudwls <boj.kr/u/skgudwls>                +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/2753                           #+#        #+#      #+#    */
/*   Solved: 2025/02/02 14:49:23 by skgudwls      ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

int main()
{
    int input;
    size_t output;
    std::cin >> input;
    // 1. 400의 배수일 때
    // 2. 4의 배수이면서 100의 배수는 아닐 때
    output = (input % 400 == 0) || (input % 4 == 0 && input % 100 != 0) ? 1 : 0;
    std::cout << output << std::endl;
    return 0;
}